{
  "_name_or_path": "lindsey-chang/vehicle-user-instructions-classification-bert-chinese",
  "architectures": [
    "BertModel"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "\u5f00\u8f66\u7a97",
    "1": "\u5173\u5de6\u8f66\u95e8",
    "2": "\u5173\u53f3\u524d\u8f66\u7a97",
    "3": "\u5173\u95ed\u5f15\u64ce",
    "4": "\u5173\u5de6\u524d\u8f66\u7a97",
    "5": "\u5f00\u53f3\u524d\u8f66\u7a97",
    "6": "\u5173\u5de6\u540e\u8f66\u7a97",
    "7": "\u5f00\u5de6\u540e\u8f66\u7a97",
    "8": "\u5f00\u540e\u5907\u7bb1",
    "9": "\u5173\u8f66\u95e8",
    "10": "\u5173\u8f66\u7a97",
    "11": "\u5f00\u5de6\u524d\u8f66\u7a97",
    "12": "\u5173\u53f3\u540e\u8f66\u7a97",
    "13": "\u5f00\u655e\u7bf7",
    "14": "\u5f00\u5de6\u4fa7\u8f66\u7a97",
    "15": "\u5173\u655e\u7bf7",
    "16": "\u5587\u53ed",
    "17": "\u5f00\u53f3\u540e\u8f66\u7a97",
    "18": "\u5f00\u53f3\u8f66\u95e8",
    "19": "\u505c\u8f66\u70b91",
    "20": "\u5173\u540e\u5907\u7bb1",
    "21": "\u5173\u53f3\u8f66\u95e8",
    "22": "\u5f00\u5de6\u8f66\u95e8",
    "23": "\u505c\u8f66\u70b92",
    "24": "\u5f00\u8f66\u95e8",
    "25": "\u6253\u5f00\u5f15\u64ce",
    "26": "\u5173\u5de6\u4fa7\u8f66\u7a97"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "\u505c\u8f66\u70b91": 19,
    "\u505c\u8f66\u70b92": 23,
    "\u5173\u53f3\u524d\u8f66\u7a97": 2,
    "\u5173\u53f3\u540e\u8f66\u7a97": 12,
    "\u5173\u53f3\u8f66\u95e8": 21,
    "\u5173\u540e\u5907\u7bb1": 20,
    "\u5173\u5de6\u4fa7\u8f66\u7a97": 26,
    "\u5173\u5de6\u524d\u8f66\u7a97": 4,
    "\u5173\u5de6\u540e\u8f66\u7a97": 6,
    "\u5173\u5de6\u8f66\u95e8": 1,
    "\u5173\u655e\u7bf7": 15,
    "\u5173\u8f66\u7a97": 10,
    "\u5173\u8f66\u95e8": 9,
    "\u5173\u95ed\u5f15\u64ce": 3,
    "\u5587\u53ed": 16,
    "\u5f00\u53f3\u524d\u8f66\u7a97": 5,
    "\u5f00\u53f3\u540e\u8f66\u7a97": 17,
    "\u5f00\u53f3\u8f66\u95e8": 18,
    "\u5f00\u540e\u5907\u7bb1": 8,
    "\u5f00\u5de6\u4fa7\u8f66\u7a97": 14,
    "\u5f00\u5de6\u524d\u8f66\u7a97": 11,
    "\u5f00\u5de6\u540e\u8f66\u7a97": 7,
    "\u5f00\u5de6\u8f66\u95e8": 22,
    "\u5f00\u655e\u7bf7": 13,
    "\u5f00\u8f66\u7a97": 0,
    "\u5f00\u8f66\u95e8": 24,
    "\u6253\u5f00\u5f15\u64ce": 25
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.47.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 21128
}
