from prompts.prompts import *

left_actempcontrol = {
    "prompts": flACTempControl,
    "response": [
        "好的，主驾空调温度设置为{}度",
        "了解，主驾空调温度设置为{}度"
    ],
    "21": "二十一",
    "22": "二十二",
    "23": "二十三",   
    "24": "二十四", 
    "25": "二十五", 
    "26": "二十六", 
    "27": "二十七", 
    "28": "二十八", 
    "29": "二十九", 
    "30": "三十", 
    "31": "三十一",                             
    "32": "三十二"
}

right_actempcontrol = {
    "prompts": frACTempControl,
    "response": [
        "好的，副驾空调温度设置为{}度",
        "了解，副驾空调温度设置为{}度"
    ],
    "21": "二十一",
    "22": "二十二",
    "23": "二十三",   
    "24": "二十四", 
    "25": "二十五", 
    "26": "二十六", 
    "27": "二十七", 
    "28": "二十八", 
    "29": "二十九", 
    "30": "三十", 
    "31": "三十一",                             
    "32": "三十二"
}