from prompts.prompts import *

lfchair = {
    "prompts": left_front_chair,
    "response": [
        "好的，为您{}调整主驾驶座椅，注意行驶过程中不要调节",
        "了解，为您{}调整主驾驶座椅，请注意安全"
    ],
    "0x01": "向前",
    "0x02": "向后",
    "0x03": "向上",
    "0x04": "向下",
    "0x05": "座椅靠背向前",
    "0x06": "座椅靠背向后"
}

rlchair = {
    "prompts": right_front_chair,
    "response": [
        "好的，为您{}调整副驾驶座椅，注意行驶过程中不要调节",
        "了解，为您{}调整副驾驶座椅，请注意安全"
    ],
    "0x01": "向前",
    "0x02": "向后",
    "0x03": "向上",
    "0x04": "向下",
    "0x05": "座椅靠背向前",
    "0x06": "座椅靠背向后"
}

chair_obj = {
    "prompts": chair_prompt,
    "response": [
        "好的，为您{}调整{}座椅，注意行驶过程中不要调节",
        "了解，为您{}调整{}座椅，请注意安全",
        "好的，已为您{}{}"
    ],
    # TODO qinxiaocheng修改
    "responseOpen": '经过校验，无法调整座椅暂时',
    "chairadjust": {
        "0x01": "向前",
        "0x02": "向后",
        "0x03": "向上",
        "0x04": "向下",
        "0x05": "座椅靠背向前",
        "0x06": "座椅靠背向后",
        'SeatID': {
            "0x01": '主驾驶',
            "0x02": '副驾驶'
        }
    },
    "chairmassage": {
        "0x01": "打开",
        "0x00": "关闭",
        "MassageMode": {
            "0x01": '主驾驶按摩',
            "0x02": '副驾驶按摩'
        }
    }
}